rkarlsba/blue_pot/code/blue_pot_esp32/sdkconfig.defaults
# ESP-IDF Configuration for Blue POT ESP32

# Chip options
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

# FreeRTOS options
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TICK_RATE_HZ=1000

# UART console
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=1
CONFIG_ESP_CONSOLE_UART_RX_GPIO=3
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3

# NVS Flash
CONFIG_NVS_ENCRYPTION=n

# LWIP settings
CONFIG_LWIP_TIMERS_ONDEMAND=y

# Power Management
CONFIG_PM_ENABLE=y
